==================
abstraction
==================

(a) =>
  a
(a, b) => a
(a :: Type, b :: Type, 1, { c :: Type = 1 }) => a

fib :=
  (0) =>
    0
  (1) => 1
  <a>(n :: a = 2) =>
    fib(n - 1) + fib(n - 2)

<a ~ Type>(...a :: a) =>
  b := (c :: Type) =>
    c
  b(1)

() => 1
/ := (a, b) => /

---

(program
  expression: (abstraction
    branch: (abstraction_branch
      parameters: (parameters
        element: (identifier_pattern
          name: (identifier_pattern_name)))
      body: (block
        expression: (identifier))))
  expression: (abstraction
    branch: (abstraction_branch
      parameters: (parameters
        element: (identifier_pattern
          name: (identifier_pattern_name))
        element: (identifier_pattern
          name: (identifier_pattern_name)))
      body: (block
        expression: (identifier))))
  expression: (abstraction
    branch: (abstraction_branch
      parameters: (parameters
        element: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type)))
        element: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type)))
        element: (number)
        element: (destructuring_pattern
          pattern: (struct_pattern
            member: (shorthand_member_pattern
              name: (identifier_pattern_name)
              type: (parametric_type
                name: (type))
              default: (number)))))
      body: (block
        expression: (identifier))))
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name))
    value: (abstraction
      branch: (abstraction_branch
        parameters: (parameters
          element: (number))
        body: (block
          expression: (number)))
      branch: (abstraction_branch
        parameters: (parameters
          element: (number))
        body: (block
          expression: (number)))
      branch: (abstraction_branch
        typeParameters: (type_parameters
          parameter: (type_variable_declaration
            name: (type_variable_declaration_name)))
        parameters: (parameters
          element: (identifier_pattern
            name: (identifier_pattern_name)
            type: (type_variable)
            default: (number)))
        body: (block
          expression: (infix_application
            left: (application
              name: (identifier)
              arguments: (arguments
                element: (argument
                  value: (infix_application
                    left: (identifier)
                    name: (identifier)
                    right: (number)))))
            name: (identifier)
            right: (application
              name: (identifier)
              arguments: (arguments
                element: (argument
                  value: (infix_application
                    left: (identifier)
                    name: (identifier)
                    right: (number))))))))))
  expression: (abstraction
    branch: (abstraction_branch
      typeParameters: (type_parameters
        parameter: (type_variable_declaration
          name: (type_variable_declaration_name)
          constraint: (type_constraint
            type: (type))))
      parameters: (parameters
        rest: (rest
          name: (identifier_pattern
            name: (identifier_pattern_name)
            type: (type_variable))))
      body: (block
        expression: (assignment
          pattern: (identifier_pattern
            name: (identifier_pattern_name))
          value: (abstraction
            branch: (abstraction_branch
              parameters: (parameters
                element: (identifier_pattern
                  name: (identifier_pattern_name)
                  type: (parametric_type
                    name: (type))))
              body: (block
                expression: (identifier)))))
        expression: (application
          name: (identifier)
          arguments: (arguments
            element: (argument
              value: (number)))))))
  expression: (abstraction
    branch: (abstraction_branch
      parameters: (parameters)
      body: (block
        expression: (number))))
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name))
    value: (abstraction
      branch: (abstraction_branch
        parameters: (parameters
          element: (identifier_pattern
            name: (identifier_pattern_name))
          element: (identifier_pattern
            name: (identifier_pattern_name)))
        body: (block
          expression: (identifier))))))

==================
application
==================

a(1)(1, 2)
+(1)
a<Type<Type, Type>, Type>(?, 1)
+ 1
1 `a` -b()
a(...(a, b))

---

(program
  expression: (application
    name: (application
      name: (identifier)
      arguments: (arguments
        element: (argument
          value: (number))))
    arguments: (arguments
      element: (argument
        value: (number))
      element: (argument
        value: (number))))
  expression: (prefix_application
    name: (identifier)
    value: (group
      expression: (number)))
  expression: (application
    name: (identifier)
    typeArguments: (type_arguments
      parameter: (parametric_type
        name: (type)
        parameter: (parametric_type
          name: (type))
        parameter: (parametric_type
          name: (type)))
      parameter: (parametric_type
        name: (type)))
    arguments: (arguments
      element: (argument)
      element: (argument
        value: (number))))
  expression: (prefix_application
    name: (identifier)
    value: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (prefix_application
      name: (identifier)
      value: (application
        name: (identifier)
        arguments: (arguments))))
  expression: (application
    name: (identifier)
    arguments: (arguments
      element: (argument
        value: (spread
          value: (tuple
            element: (identifier)
            element: (identifier)))))))

==================
prefix application
==================

!false
+1
-1
~1

---

(program
  expression: (prefix_application
    name: (identifier)
    value: (boolean))
  expression: (prefix_application
    name: (identifier)
    value: (number))
  expression: (prefix_application
    name: (identifier)
    value: (number))
  expression: (prefix_application
    name: (identifier)
    value: (number)))

==================
infix application
==================

1 .. 1
1 ^ 1
1 * 1
1 / 1
1 + 1
1 - 1
1 % 1
1 < 1
1 <= 1
1 > 1
1 >= 1
1 == 1
1 != 1
a === 1
1 !== b
a ~ b
false && false
false || false
false ==> true <=> true
false && false || false
false || false && false
1 + 1 % 1
1 - 1 + 1
1 - -1
1 * 1 / 1 - 1
false || !false
(a.b) . c ^ 1 . (d.e)

---

(program
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (identifier)
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (identifier))
  expression: (infix_application
    left: (identifier)
    name: (identifier)
    right: (identifier))
  expression: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  expression: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  expression: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  expression: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  expression: (infix_application
    left: (boolean)
    name: (identifier)
    right: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean)))
  expression: (infix_application
    left: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (number)
    name: (identifier)
    right: (prefix_application
      name: (identifier)
      value: (number)))
  expression: (infix_application
    left: (infix_application
      left: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  expression: (infix_application
    left: (boolean)
    name: (identifier)
    right: (prefix_application
      name: (identifier)
      value: (boolean)))
  expression: (infix_application
    left: (pipeline
      value: (group
        expression: (pipeline
          value: (identifier)
          name: (identifier)))
      name: (identifier))
    name: (identifier)
    right: (pipeline
      value: (number)
      name: (group
        expression: (pipeline
          value: (identifier)
          name: (identifier))))))

==================
pipeline
==================

a.b.c(1)

---

(program
  expression: (application
    name: (pipeline
      value: (pipeline
        value: (identifier)
        name: (identifier))
      name: (identifier))
    arguments: (arguments
      element: (argument
        value: (number)))))

==================
access
==================

a[0]
a->b(1)
a.b[c]

---

(program
  expression: (access
      name: (identifier)
      value: (number))
  expression: (application
    name: (access
      name: (identifier)
      value: (shorthand_access_identifier))
    arguments: (arguments
      element: (argument
        value: (number))))
  expression: (pipeline
    value: (identifier)
    name: (access
      name: (identifier)
      value: (identifier))))

==================
assignment
==================

a :: Type := 1
a := (a :: Type) =>
  1

---

(program
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name)
      type: (parametric_type
        name: (type)))
    value: (number))
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name))
    value: (abstraction
      branch: (abstraction_branch
        parameters: (parameters
          element: (identifier_pattern
            name: (identifier_pattern_name)
            type: (parametric_type
              name: (type))))
        body: (block
          expression: (number))))))

==================
import
==================

import
  a as b,
  c,
  a as b :: Type,
  c :: Type,
  Type as Type,
  Type
from 'source'
import a, b from 'source'

---

(program
  expression: (import
    import: (import_identifier
      name: (identifier_pattern_name)
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    import: (import_identifier
      name: (identifier_pattern_name)
      as: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type))))
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type))))
    import: (import_type
      name: (type)
      as: (type))
    import: (import_type
      name: (type))
    source: (raw_string))
  expression: (import
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    source: (raw_string)))

==================
external import
==================

export a, b from 'source'

---

(program
  expression: (exported_import
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    import: (import_identifier
      as: (identifier_pattern
        name: (identifier_pattern_name)))
    source: (raw_string)))

==================
export
==================

export a := 1
export module a where
  export a := 1

---

(program
  expression: (export
    declaration: (assignment
      pattern: (identifier_pattern
        name: (identifier_pattern_name))
      value: (number)))
  expression: (export
    declaration: (module
      name: (identifier_pattern_name)
      body: (block
        expression: (export
          declaration: (assignment
            pattern: (identifier_pattern
              name: (identifier_pattern_name))
            value: (number)))))))

==================
return
==================

return 1
return (a :: Type) =>
  1

---

(program
  expression: (return
    value: (number))
  expression: (return
    value: (abstraction
      branch: (abstraction_branch
        parameters: (parameters
          element: (identifier_pattern
            name: (identifier_pattern_name)
            type: (parametric_type
              name: (type))))
        body: (block
          expression: (number))))))

==================
if
==================

if false then
  1
if true then
  1
else
  1
a :=
  if true then
    1
  else if false then 1
  else if true then
    1

fn(if false then 1)
if true then 1 else 1

---

(program
  expression: (if
    condition: (boolean)
    body: (block
      expression: (number)))
  expression: (if
    condition: (boolean)
    body: (block
      expression: (number))
    else: (block
      expression: (number)))
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name))
    value: (if
      condition: (boolean)
      body: (block
        expression: (number))
      else_if: (else_if
        condition: (boolean)
        body: (block
          expression: (number)))
      else_if: (else_if
        condition: (boolean)
        body: (block
          expression: (number)))))
  expression: (application
    name: (identifier)
    arguments: (arguments
      element: (argument
        value: (if
          condition: (boolean)
          body: (block
            expression: (number))))))
  expression: (if
    condition: (boolean)
    body: (block
      expression: (number))
    else: (block
      expression: (number))))

==================
case
==================

a := case a
     when 1 then
       1
     else 1

case a
when [1, a :: Type] then
  a
when 1, 1 then 1
else 1

---

(program
  expression: (assignment
    pattern: (identifier_pattern
      name: (identifier_pattern_name))
    value: (case
      value: (identifier)
      when: (when
        pattern: (number)
        body: (block
          expression: (number)))
      else: (block
        expression: (number))))
  expression: (case
    value: (identifier)
    when: (when
      pattern: (destructuring_pattern
        pattern: (list_pattern
          element: (number)
          element: (identifier_pattern
            name: (identifier_pattern_name)
            type: (parametric_type
              name: (type)))))
      body: (block
        expression: (identifier)))
    when: (when
      pattern: (number)
      pattern: (number)
      body: (block
        expression: (number)))
    else: (block
      expression: (number))))

==================
module
==================

module a where
  a := 1
module a<a ~ Num, b ~ (Num, Eq, Ord)> where a :: a := 1

---

(program
  expression: (module
    name: (identifier_pattern_name)
    body: (block
      expression: (assignment
        pattern: (identifier_pattern
          name: (identifier_pattern_name))
        value: (number))))
  expression: (module
    name: (identifier_pattern_name)
    parameter: (type_variable_declaration
      name: (type_variable_declaration_name)
      constraint: (type_constraint
        type: (type)))
    parameter: (type_variable_declaration
      name: (type_variable_declaration_name)
      constraint: (type_constraint
        type: (type)
        type: (type)
        type: (type)))
    body: (block
      expression: (assignment
        pattern: (identifier_pattern
          name: (identifier_pattern_name)
          type: (type_variable))
        value: (number)))))

==================
enum
==================

enum Type
  A
  B = 'string'

---

(program
  expression: (enum
    name: (type)
    value: (enum_value
      name: (type))
    value: (enum_value
      name: (type)
      value: (string))))

==================
interface
==================

interface Type<a>
  a :: a -> Number
  b :: a -> Number
interface Ord<a ~ Eq>
  compare :: a -> a -> Number

---

(program
  expression: (interface
    name: (type_declaration
      name: (type)
      parameter: (type_variable_declaration
        name: (type_variable_declaration_name)))
    member: (identifier_pattern
      name: (identifier_pattern_name)
      type: (curried_type
        from: (type_variable)
        to: (parametric_type
          name: (type))))
    member: (identifier_pattern
      name: (identifier_pattern_name)
      type: (curried_type
        from: (type_variable)
        to: (parametric_type
          name: (type)))))
  expression: (interface
    name: (type_declaration
      name: (type)
      parameter: (type_variable_declaration
        name: (type_variable_declaration_name)
        constraint: (type_constraint
          type: (type))))
    member: (identifier_pattern
      name: (identifier_pattern_name)
      type: (curried_type
        from: (type_variable)
        to: (curried_type
          from: (type_variable)
          to: (parametric_type
            name: (type)))))))

==================
implement
==================

implement Ord<Number>
  compare := 1

---

(program
  expression: (implement
    name: (parametric_type
      name: (type)
      parameter: (parametric_type
        name: (type)))
    assignment: (assignment
      pattern: (identifier_pattern
        name: (identifier_pattern_name))
      value: (number))))

==================
struct
==================

{}
{ a, b }
{ ['a']: 1, ...b, c: 'str', d, e }

---

(program
  expression: (struct)
  expression: (struct
    member: (shorthand_member)
    member: (shorthand_member))
  expression: (struct
    member: (member
      key: (string)
      value: (number))
    member: (spread
      value: (identifier))
    member: (member
      key: (shorthand_member_identifier)
      value: (string))
    member: (shorthand_member)
    member: (shorthand_member)))

==================
named struct
==================

constructor:{}
constructor:{ a, b }
constructor:{ ['a']: 1, ...b, c: 'str', d, e }

---

(program
  expression: (named_value
    name: (constructor)
    value: (struct))
  expression: (named_value
    name: (constructor)
    value: (struct
      member: (shorthand_member)
      member: (shorthand_member)))
  expression: (named_value
    name: (constructor)
    value: (struct
      member: (member
        key: (string)
        value: (number))
      member: (spread
        value: (identifier))
      member: (member
        key: (shorthand_member_identifier)
        value: (string))
      member: (shorthand_member)
      member: (shorthand_member))))

==================
tuple
==================

()
(a, 1, 'str', ...x)
(1,1)

---

(program
  expression: (tuple)
  expression: (tuple
    element: (identifier)
    element: (number)
    element: (string)
    element: (spread
      value: (identifier)))
  expression: (tuple
    element: (number)
    element: (number)))

==================
named tuple
==================

constructor:()
constructor:(a, 1, 'str', ...x)
constructor:(1,1)

---

(program
  expression: (named_value
    name: (constructor)
    value: (tuple))
  expression: (named_value
    name: (constructor)
    value: (tuple
      element: (identifier)
      element: (number)
      element: (string)
      element: (spread
        value: (identifier))))
  expression: (named_value
    name: (constructor)
    value: (tuple
      element: (number)
      element: (number))))

==================
list
==================

[]
[a, 1, ...b, 'str']
[1,1..1,1]

---

(program
  expression: (list)
  expression: (list
    element: (identifier)
    element: (number)
    element: (spread
      value: (identifier))
    element: (string))
  expression: (list
    element: (number)
    element: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    element: (number)))

==================
named list
==================

constructor:[]
constructor:[a, 1, ...b, 'str']
constructor:[1,1..1,1]

---

(program
  expression: (named_value
    name: (constructor)
    value: (list))
  expression: (named_value
    name: (constructor)
    value: (list
      element: (identifier)
      element: (number)
      element: (spread
        value: (identifier))
      element: (string)))
  expression: (named_value
    name: (constructor)
    value: (list
      element: (number)
      element: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      element: (number))))

==================
list comprehension
==================

[i * 2 | i in 1..10]
[i / 2 | i in 1..10 if i % 2 == 0]
[[x, y] | x in 1..10 if x % 2 == 0, y in 1..10 if i % 2 == 0]

---

(program
  expression: (list_comprehension
    body: (block
      expression: (infix_application
        left: (identifier)
        name: (identifier)
        right: (number)))
    generator: (generator
      name: (identifier_pattern_name)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number))))
  expression: (list_comprehension
    body: (block
      expression: (infix_application
        left: (identifier)
        name: (identifier)
        right: (number)))
    generator: (generator
      name: (identifier_pattern_name)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      condition: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number))))
  expression: (list_comprehension
    body: (block
      expression: (list
        element: (identifier)
        element: (identifier)))
    generator: (generator
      name: (identifier_pattern_name)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      condition: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number)))
    generator: (generator
      name: (identifier_pattern_name)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      condition: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number)))))

==================
named value
==================

constructor: 'String'
constructor: 1

---

(program
  expression: (named_value
    name: (constructor)
    value: (string))
  expression: (named_value
    name: (constructor)
    value: (number)))

==================
type alias
==================

type Type := Type
type Type<a, b ~ Num> := a -> b

---

(program
  expression: (type_alias
    name: (type_declaration
      name: (type))
    type: (parametric_type
      name: (type)))
  expression: (type_alias
    name: (type_declaration
      name: (type)
      parameter: (type_variable_declaration
        name: (type_variable_declaration_name))
      parameter: (type_variable_declaration
        name: (type_variable_declaration_name)
        constraint: (type_constraint
          type: (type))))
    type: (curried_type
      from: (type_variable)
      to: (type_variable))))

==================
type hint
==================

'string' as String

---

(program
  expression: (type_hint
    value: (string)
    type: (parametric_type
      name: (type))))

==================
group
==================

(1)
(n)
(-1)
(-n)
n / ((n + 1) * (-2))

---

(program
  expression: (group
    expression: (number))
  expression: (group
    expression: (identifier))
  expression: (group
    expression: (prefix_application
      name: (identifier)
      value: (number)))
  expression: (group
    expression: (prefix_application
      name: (identifier)
      value: (identifier)))
  expression: (infix_application
    left: (identifier)
    name: (identifier)
    right: (group
      expression: (infix_application
        left: (group
          expression: (infix_application
            left: (identifier)
            name: (identifier)
            right: (number)))
        name: (identifier)
        right: (group
          expression: (prefix_application
            name: (identifier)
            value: (number)))))))
