==================
abstraction
==================

a = 1, b => a

---

(program
  (abstraction
    parameters: (parameters
      (parameter
        name: (identifier)
        value: (number))
      (parameter
        name: (identifier)))
    body: (identifier)))

==================
application
==================

a(1)(1)
+(1)
a(1)
+ 1
a 1
1 `a` -b(1)

---

(program
  (application
    abstraction: (application
      abstraction: (identifier)
    arguments: (arguments
      (argument
        value: (number))))
  arguments: (arguments
      (argument
        value: (number))))
  (application
    abstraction: (identifier)
  arguments: (arguments
      (argument
        value: (number))))
  (application
    abstraction: (identifier)
    arguments: (arguments
      (argument
        value: (number))))
  (prefix_application
    abstraction: (identifier)
    argument: (number))
  (prefix_application
    abstraction: (identifier)
    argument: (number))
  (infix_application
    left: (number)
    right: (prefix_application
      abstraction: (identifier)
      argument: (application
        abstraction: (identifier)
        arguments: (arguments
          (argument
            value: (number)))))))

==================
unary expressions
==================

!false
+1
-1
~1

---

(program
  (prefix_application
    abstraction: (identifier)
    argument: (boolean))
  (prefix_application
    abstraction: (identifier)
    argument: (number))
  (prefix_application
    abstraction: (identifier)
    argument: (number))
  (prefix_application
    abstraction: (identifier)
    argument: (number)))

==================
binary expressions
==================

1 ^ 1
1 * 1
1 / 1
1 + 1
1 - 1
1 % 1
1 < 1
1 <= 1
1 > 1
1 >= 1
1 == 1
1 != 1
a === 1
1 !== b
a ~ b
false && false
false || false
false ==> true <=> true
false && false || false
false || false && false
1 - 1 + 1
1 - -1
1 * 1 / 1 - 1
false || !false
(a.b) . c ^ 1 . (d.e)

---

(program
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (number)
    right: (number))
  (infix_application
    left: (identifier)
    right: (number))
  (infix_application
    left: (number)
    right: (identifier))
  (infix_application
    left: (identifier)
    right: (identifier))
  (infix_application
    left: (boolean)
    right: (boolean))
  (infix_application
    left: (boolean)
    right: (boolean))
  (infix_application
    left: (infix_application
      left: (boolean)
      right: (boolean))
    right: (boolean))
  (infix_application
    left: (infix_application
      left: (boolean)
      right: (boolean))
    right: (boolean))
  (infix_application
    left: (boolean)
    right: (infix_application
      left: (boolean)
      right: (boolean)))
  (infix_application
    left: (infix_application
      left: (number)
      right: (number))
    right: (number))
  (infix_application
    left: (number)
    right: (prefix_application
      abstraction: (identifier)
      argument: (number)))
  (infix_application
    left: (infix_application
      left: (infix_application
        left: (number)
        right: (number))
      right: (number))
    right: (number))
  (infix_application
    left: (boolean)
    right: (prefix_application
      abstraction: (identifier)
      argument: (boolean)))
  (infix_application
    left: (pipeline
      left: (pipeline
        left: (identifier)
        right: (identifier))
      right: (identifier))
    right: (pipeline
      left: (number)
      right: (pipeline
        left: (identifier)
        right: (identifier)))))

==================
pipeline
==================

a.b.c(1)

---

(program
  (application
    abstraction: (pipeline
      left: (pipeline
        left: (identifier)
        right: (identifier))
      right: (identifier))
    arguments: (arguments
      (argument
        value: (number)))))

==================
assignment
==================

a := 1
a := a =>
  1

---

(program
  (assignment
    left: (identifier)
    right: (number))
  (assignment
    left: (identifier)
    right: (abstraction
      parameters: (parameters
        (parameter
          name: (identifier)))
      body: (block
        (number)))))

==================
return
==================

return 1
return a =>
  1

---

(program
  (return
    (number))
  (return
    (abstraction
      (parameters
        (parameter
          (identifier)))
      (block
        (number)))))
