==================
type
==================

Type
AaA0Z

---

(program
  expression: (parametric_type
    name: (type))
  expression: (parametric_type
    name: (type)))

==================
boolean
==================

false
true

---

(program
  expression: (boolean)
  expression: (boolean))

==================
decimal
==================

-0.6_6
+0.1_1
123.4123
1_1.3_1
1_1.0
1e3_4
0.3e1_4
1e322
1e-3
1e3
1.8e10
1.0e10
-1e10

---

(program
  expression: (prefix_application
    value: (identifier)
    argument: (number))
  expression: (prefix_application
    value: (identifier)
    argument: (number))
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (prefix_application
    value: (identifier)
    argument: (number)))

==================
integer
==================

-1
0xDEAD
0o123
0b001
1_1
0x1_1
0o1_1
0b1_1

---

(program
  expression: (prefix_application
    value: (identifier)
    argument: (number))
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number)
  expression: (number))

=====================================
identifier
=====================================

abs
a5_ds_
abs?
+
\
||
/
.?

---

(program
  expression: (identifier)
  expression: (identifier)
  expression: (identifier)
  expression: (identifier)
  expression: (identifier)
  expression: (identifier)
  expression: (identifier)
  expression: (identifier))

=====================================
string
=====================================

"I'm ok"
'"ok"'
"\\"
"/"
"multiline \
string"
'{func}'

---

(program
  expression: (string)
  expression: (string)
  expression: (string
    escape_sequence: (escape_sequence))
  expression: (string)
  expression: (string
    escape_sequence: (escape_sequence))
  expression: (string
    interpolation: (interpolation
      value: (identifier))))

=====================================
regex
=====================================

r/one\\/
r/one/g
r/one/i
r/one/gim
r/on\/e/gim
r/on[^/]afe/gim
r/[\]/]/

---

(program
  expression: (regex
    pattern: (regex_pattern))
  expression: (regex
    pattern: (regex_pattern)
    flags: (regex_flags))
  expression: (regex
    pattern: (regex_pattern)
    flags: (regex_flags))
  expression: (regex
    pattern: (regex_pattern)
    flags: (regex_flags))
  expression: (regex
    pattern: (regex_pattern)
    flags: (regex_flags))
  expression: (regex
    pattern: (regex_pattern)
    flags: (regex_flags))
  expression: (regex
    pattern: (regex_pattern)))
