============================================
struct pattern
============================================

{ b: c :: Type } := a
{ b: c :: Type, d :: Type, ['e']: e :: Type, ...f :: Type = {} } := a

---

(program
  expression: (assignment
    pattern: (struct_pattern
      member: (member_pattern
        key: (shorthand_access_identifier)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type)))))
    value: (identifier))
  expression: (assignment
    pattern: (struct_pattern
      member: (member_pattern
        key: (shorthand_access_identifier)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))))
      member: (shorthand_member_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      member: (member_pattern
        key: (string)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))
          default: (struct))))
    value: (identifier)))

============================================
named struct pattern
============================================

Struct{ b: c :: Type } := a
Struct{ b: c :: Type, d :: Type, ['e']: e :: Type, ...f :: Type = {} } := a

---

(program
  expression: (assignment
    pattern: (named_struct_pattern
      name: (type)
      member: (member_pattern
        key: (shorthand_access_identifier)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type)))))
    value: (identifier))
  expression: (assignment
    pattern: (named_struct_pattern
      name: (type)
      member: (member_pattern
        key: (shorthand_access_identifier)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))))
      member: (shorthand_member_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      member: (member_pattern
        key: (string)
        value: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))
          default: (struct))))
    value: (identifier)))

============================================
tuple pattern
============================================

(A, b :: Type, ...c) := a

---

(program
  expression: (assignment
    pattern: (tuple_pattern
      value: (parametric_type
        name: (type))
      value: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name))))
    value: (identifier)))

============================================
named tuple pattern
============================================

Tuple(A, b :: Type, ...c) := a

---

(program
  expression: (assignment
    pattern: (named_tuple_pattern
      name: (type)
      value: (parametric_type
        name: (type))
      value: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name))))
    value: (identifier)))

============================================
list pattern
============================================

[b :: Type, c :: Type] := a
[b :: Type, c :: Type, ...d :: Type = [1]] := a

---

(program
  expression: (assignment
    pattern: (list_pattern
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type))))
    value: (identifier))
  expression: (assignment
    pattern: (list_pattern
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))
          default: (list
            element: (number)))))
    value: (identifier)))

============================================
named list pattern
============================================

List[b :: Type, c :: Type] := a
List[b :: Type, c :: Type, ...d :: Type = [1]] := a

---

(program
  expression: (assignment
    pattern: (named_list_pattern
      name: (type)
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type))))
    value: (identifier))
  expression: (assignment
    pattern: (named_list_pattern
      name: (type)
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      element: (identifier_pattern
        name: (identifier_pattern_name)
        type: (parametric_type
          name: (type)))
      rest: (rest
        name: (identifier_pattern
          name: (identifier_pattern_name)
          type: (parametric_type
            name: (type))
          default: (list
            element: (number)))))
    value: (identifier)))
