==================
function
==================

(a) =>
  a
(a, b) => a
(a: Type, b: Type, 1, { c: Type := 1 }) => a

fib = (x) =>
  0
fib = (x) => 1
fib = <T>(n: T := 2) =>
  fib(n - 1) + fib(n - 2)

<T <: Type>(...a: T) => {
  b = (c: Type) =>
    c
  b(1)
}

() => 1
/ = (a, b) => /

fn :: Number => Number? => Number = (a, b := 5) => a + b

---

(program
  term: (function
    element: (binding_pattern
      name: (identifier_pattern))
    body: (identifier))
  term: (function
    element: (binding_pattern
      name: (identifier_pattern))
    element: (binding_pattern
      name: (identifier_pattern))
    body: (identifier))
  term: (function
    element: (binding_pattern
      name: (identifier_pattern)
      type: (parametric_type
        name: (type)))
    element: (binding_pattern
      name: (identifier_pattern)
      type: (parametric_type
        name: (type)))
    element: (number)
    element: (destructuring_pattern
      pattern: (struct_pattern
        member: (shorthand_member_pattern
          name: (identifier_pattern)
          type: (parametric_type
            name: (type))
          default: (number))))
    body: (identifier))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      element: (binding_pattern
        name: (identifier_pattern))
      body: (number)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      element: (binding_pattern
        name: (identifier_pattern))
      body: (number)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      typeParameter: (type_variable_declaration
        name: (type_variable_declaration_name))
      element: (binding_pattern
        name: (identifier_pattern)
        type: (parametric_type
          name: (type))
        default: (number))
      body: (infix_application
        left: (application
          name: (identifier)
          element: (argument
            value: (infix_application
              left: (identifier)
              name: (identifier)
              right: (number))))
        name: (identifier)
        right: (application
          name: (identifier)
          element: (argument
            value: (infix_application
              left: (identifier)
              name: (identifier)
              right: (number)))))))
  term: (function
    typeParameter: (type_variable_declaration
      name: (type_variable_declaration_name)
      constraint: (parametric_type
        name: (type)))
    rest: (binding_pattern
      name: (identifier_pattern)
      type: (parametric_type
        name: (type)))
    body: (block
      term: (assignment
        pattern: (binding_pattern
          name: (identifier_pattern))
        value: (function
          element: (binding_pattern
            name: (identifier_pattern)
            type: (parametric_type
              name: (type)))
          body: (identifier)))
      term: (application
        name: (identifier)
        element: (argument
          value: (number)))))
  term: (function
    body: (number))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      element: (binding_pattern
        name: (identifier_pattern))
      element: (binding_pattern
        name: (identifier_pattern))
      body: (identifier)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern)
      type: (curried_type
        from: (parametric_type
          name: (type))
        to: (curried_type
          from: (optional_type
            type: (parametric_type
              name: (type)))
          to: (parametric_type
            name: (type)))))
    value: (function
      element: (binding_pattern
        name: (identifier_pattern))
      element: (binding_pattern
        name: (identifier_pattern)
        default: (number))
      body: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier)))))

==================
application
==================

a(1)(1, 2)
+(1)
a<Type<Type, Type>, Type>(?, 1)
+ 1
1 `a` -b
1 `a` -(b())
a(...(a, b))

f('String')
f(1)
f(())

---

(program
  term: (application
    name: (application
      name: (identifier)
      element: (argument
        value: (number)))
    element: (argument
      value: (number))
    element: (argument
      value: (number)))
  term: (application
    name: (identifier)
    element: (argument
      value: (number)))
  term: (application
    name: (parametric_type_instance
      name: (identifier)
      typeArgument: (parametric_type
        name: (type)
        argument: (parametric_type
          name: (type))
        argument: (parametric_type
          name: (type)))
      typeArgument: (parametric_type
        name: (type)))
    element: (argument)
    element: (argument
      value: (number)))
  term: (application
    name: (identifier)
    element: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (application
      name: (identifier)
      element: (identifier)))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (application
      name: (identifier)
      element: (argument
        value: (application
          name: (identifier)))))
  term: (application
    name: (identifier)
    element: (argument
      value: (spread
        value: (tuple
          element: (identifier)
          element: (identifier)))))
  term: (application
    name: (identifier)
    element: (argument
      value: (string)))
  term: (application
    name: (identifier)
    element: (argument
      value: (number)))
  term: (application
    name: (identifier)
    element: (argument
      value: (tuple))))

==================
prefix application
==================

!false
+1
-1
~1

---

(program
  term: (application
    name: (identifier)
    element: (boolean))
  term: (application
    name: (identifier)
    element: (number))
  term: (application
    name: (identifier)
    element: (number))
  term: (application
    name: (identifier)
    element: (number)))

==================
infix application
==================

1 .. 1
1 ^ 1
1 * 1
1 / 1
1 + 1
1 - 1
1 % 1
1 < 1
1 <= 1
1 > 1
1 >= 1
1 == 1
1 != 1
a === 1
1 !== b
a ~ b
false && false
false || false
false ==> true <=> true
false && false || false
false || false && false
1 + 1 % 1
1 - 1 + 1
1 - -1
1 * 1 / 1 - 1
false || !false
(a.b) . c ^ 1 . (d.e)
a.b.c(1)
a&.b&.c(1)

---

(program
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (identifier)
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (identifier))
  term: (infix_application
    left: (identifier)
    name: (identifier)
    right: (identifier))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean)))
  term: (infix_application
    left: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (number)
    name: (identifier)
    right: (application
      name: (identifier)
      element: (number)))
  term: (infix_application
    left: (infix_application
      left: (infix_application
        left: (number)
        name: (identifier)
        right: (number))
      name: (identifier)
      right: (number))
    name: (identifier)
    right: (number))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (application
      name: (identifier)
      element: (boolean)))
  term: (infix_application
    left: (infix_application
      left: (group
        term: (infix_application
          left: (identifier)
          name: (identifier)
          right: (identifier)))
      name: (identifier)
      right: (identifier))
    name: (identifier)
    right: (infix_application
      left: (number)
      name: (identifier)
      right: (group
        term: (infix_application
          left: (identifier)
          name: (identifier)
          right: (identifier)))))
  term: (application
    name: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))
      name: (identifier)
      right: (identifier))
    element: (argument
      value: (number)))
  term: (application
    name: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))
      name: (identifier)
      right: (identifier))
    element: (argument
      value: (number))))

==================
sections
==================

((+) 1)
(1 (+))
(`mod` 1)
(1 `mod`)

---

(program
  term: (right_section
    name: (identifier)
    value: (number))
  term: (left_section
    value: (number)
    name: (identifier))
  term: (right_section
    name: (identifier)
    value: (number))
  term: (left_section
    value: (number)
    name: (identifier)))

==================
access
==================

a[0]
a->b(1)
a.b[c]

---

(program
  term: (access
      name: (identifier)
      value: (number))
  term: (application
    name: (access
      name: (identifier)
      value: (shorthand_access_identifier))
    element: (argument
      value: (number)))
  term: (access
    name: (infix_application
      left: (identifier)
      name: (identifier)
      right: (identifier))
    value: (identifier)))

==================
assignment
==================

a: Type = 1
a = (a: Type) =>
  1

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern)
      type: (type))
    value: (number))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      element: (binding_pattern
        name: (identifier_pattern)
        type: (type))
      body: (number))))

==================
export
==================

export a = 1
export a = (x: T) =>
  1

---

(program
  term: (export
    declaration: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (number)))
  term: (export
    declaration: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (function
        element: (binding_pattern
          name: (identifier_pattern)
          type: (type))
        body: (number)))))

==================
return
==================

return 1
return (a: Type) =>
  1

---

(program
  term: (return
    value: (number))
  term: (return
    value: (function
      element: (binding_pattern
        name: (identifier_pattern)
        type: (type))
      body: (number))))

==================
if
==================

if false then
  1
if true {
  1
  1
} else 1

a =
  if true {
    1
  } else if false then 1 else if true {
    1
  }

fn(false ? 1)
true ? 1 : 1

---

(program
  term: (if
    condition: (boolean)
    body: (number))
  term: (if
    condition: (boolean)
    body: (block
      term: (number)
      term: (number))
    else: (number))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (if
      condition: (boolean)
      body: (block
        term: (number))
      elseIf: (else_if
        condition: (boolean)
        body: (number))
      elseIf: (else_if
        condition: (boolean)
        body: (block
          term: (number)))))
  term: (application
    name: (identifier)
    element: (argument
      value: (ternary
        condition: (boolean)
        body: (number))))
  term: (ternary
    condition: (boolean)
    body: (number)
    else: (number)))

==================
case
==================

a =
  case a
  when 1 then {
    1
  }
  else 1

case a
when [1, a: Type] {
  a
}
when 1, 1 then 1
else {
  1
  1
}

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (case
      value: (identifier)
      when: (when
        pattern: (number)
        body: (block
          term: (number)))
      else: (number)))
  term: (case
    value: (identifier)
    when: (when
      pattern: (destructuring_pattern
        pattern: (list_pattern
          element: (number)
          element: (binding_pattern
            name: (identifier_pattern)
            type: (type))))
      body: (block
        term: (identifier)))
    when: (when
      pattern: (number)
      pattern: (number)
      body: (number))
    else: (block
      term: (number)
      term: (number))))

==================
class
==================

class Type {
  a: Type => Number
  b: Type => Number
}
class Ord: Num & Eq {
  compare: Ord => Ord => Number
}

---

(program
  term: (class
    name: (type)
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (type)))
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (type))))
  term: (class
    name: (type)
    constraint: (type)
    constraint: (type)
    constraint: (type)
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (function_type
          from: (type)
          to: (type))))))

==================
instance
==================

instance Number of Ord {
  compare = 1
}
instance (T: Type, U: Type) => Type(T, U) of Type {
  f = 1
}

---

(program
  term: (instance
    name: (type)
    class: (type)
    assignment: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (number)))
  term: (instance
    name: (type)
    parameter: (type_variable_declaration
      name: (type_variable_declaration_name)
      constraint: (parametric_type
        name: (type)))
    parameter: (type_variable_declaration
      name: (type_variable_declaration_name)
      constraint: (parametric_type
        name: (type)))
    class: (type)
    assignment: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (number))))

==================
struct
==================

{}
{ a, b }
{ ['a']: 1, ...b, c: 'str', d, e }

---

(program
  term: (struct)
  term: (struct
    member: (shorthand_member)
    member: (shorthand_member))
  term: (struct
    member: (member
      key: (string)
      value: (number))
    member: (spread
      value: (identifier))
    member: (member
      key: (shorthand_member_identifier)
      value: (string))
    member: (shorthand_member)
    member: (shorthand_member)))

==================
tuple
==================

()
(a, 1, 'str', ...x)
(1,1)

---

(program
  term: (tuple)
  term: (tuple
    element: (identifier)
    element: (number)
    element: (string)
    element: (spread
      value: (identifier)))
  term: (tuple
    element: (number)
    element: (number)))

==================
list
==================

[]
[a, 1, ...b, 'str']
[1,1..1,1]

---

(program
  term: (list)
  term: (list
    element: (identifier)
    element: (number)
    element: (spread
      value: (identifier))
    element: (string))
  term: (list
    element: (number)
    element: (infix_application
      left: (number)
      name: (identifier)
      right: (number))
    element: (number)))

==================
list comprehension
==================

[i * 2 | i in 1..10]
[i / 2 | i in 1..10, i % 2 == 0]
[[x, y] | x in 1..10, x % 2 == 0, y in 1..10, i % 2 == 0]

---

(program
  term: (list_comprehension
    body: (infix_application
      left: (identifier)
      name: (identifier)
      right: (number))
    generator: (list_comprehension_generator
      name: (identifier_pattern)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number))))
  term: (list_comprehension
    body: (infix_application
      left: (identifier)
      name: (identifier)
      right: (number))
    generator: (list_comprehension_generator
      name: (identifier_pattern)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number)))
    condition: (list_comprehension_condition
      value: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number))))
  term: (list_comprehension
    body: (list
      element: (identifier)
      element: (identifier))
    generator: (list_comprehension_generator
      name: (identifier_pattern)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number)))
    condition: (list_comprehension_condition
      value: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number)))
    generator: (list_comprehension_generator
      name: (identifier_pattern)
      value: (infix_application
        left: (number)
        name: (identifier)
        right: (number)))
    condition: (list_comprehension_condition
      value: (infix_application
        left: (infix_application
          left: (identifier)
          name: (identifier)
          right: (number))
        name: (identifier)
        right: (number)))))

==================
parametric type instance
==================

value<Type>
(<T>(a: T) => a)<Type>

---

(program
  term: (parametric_type_instance
    name: (identifier)
    typeArgument: (type))
  term: (parametric_type_instance
    name: (group
      term: (function
        typeParameter: (type_variable_declaration
          name: (type_variable_declaration_name))
        element: (binding_pattern
          name: (identifier_pattern)
          type: (type))
        body: (identifier)))
    typeArgument: (type)))

==================
block
==================

{
  y = 1
  z = pure x
  return y + z
}
10.times (i) => {
  io->print '{i}-th line'
}

---

(program
  term: (block
    term: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (number))
    term: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (pure
        value: (identifier)))
    term: (return
      value: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))))
  term: (application
    name: (infix_application
      left: (number)
      name: (identifier)
      right: (identifier))
    element: (function
      element: (binding_pattern
        name: (identifier_pattern))
      body: (block
        term: (application
          name: (access
            name: (identifier)
            value: (shorthand_access_identifier))
          element: (string
            interpolation: (interpolation
              term: (identifier))))))))

==================
type alias
==================

Type = Type
Type = (T, U: Num) => T -> U
GreaterThan = (T, x: T) => T

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
    value: (type))
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
      value: (function
        element: (binding_pattern
          name: (type_pattern))
        element: (binding_pattern
          name: (type_pattern)
          type: (type))
        body: (function_type
          from: (type)
          to: (type))))
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
      value: (function
        element: (binding_pattern
          name: (type_pattern))
        element: (binding_pattern
          name: (identifier_pattern)
          type: (type))
        body: (type))))

==================
data
==================

data Type = tag Type
data Type = tag Type | tag

---

(program
  term: (data
    name: (type)
    constructor: (data_constructor
      name: (identifier_pattern)
      type: (type)))
  term: (data
    name: (type)
    constructor: (data_constructor
      name: (identifier_pattern)
      type: (type))
    constructor: (data_constructor
      name: (identifier_pattern))))

==================
type hint
==================

'string' as String

---

(program
  term: (type_hint
    value: (string)
    type: (type)))

==================
hole
==================

?hole

---

(program
  term: (hole
    name: (identifier_pattern)))

==================
group
==================

(1)
(n)
(-1)
(-n)
n / ((n + 1) * (-2))

---

(program
  term: (group
    term: (number))
  term: (group
    term: (identifier))
  term: (group
    term: (application
      name: (identifier)
      element: (number)))
  term: (group
    term: (application
      name: (identifier)
      element: (identifier)))
  term: (infix_application
    left: (identifier)
    name: (identifier)
    right: (group
      term: (infix_application
        left: (group
          term: (infix_application
            left: (identifier)
            name: (identifier)
            right: (number)))
        name: (identifier)
        right: (group
          term: (application
            name: (identifier)
            element: (number)))))))
