==================
function
==================

(a) =>
  a
(a, b) => a
(a: Type, b: Type, 1, { c: Type = 1 }) => a

fib = (x) =>
  0
fib = (x) => 1
fib = <T>(n: T = 2) =>
  fib(n - 1) + fib(n - 2)

<T: Type>(...a: T) => {
  b = (c: Type) =>
    c
  b(1)
}

() => 1
/ = (a, b) => /

fn: Number -> ?Number -> Number = (a, b = 5) => a + b

---

(program
  term: (function
    parameter: (binding_pattern
      name: (identifier_pattern))
    body: (identifier))
  term: (function
    parameter: (binding_pattern
      name: (identifier_pattern))
    parameter: (binding_pattern
      name: (identifier_pattern))
    body: (identifier))
  term: (function
    parameter: (binding_pattern
      name: (identifier_pattern)
      type: (type))
    parameter: (binding_pattern
      name: (identifier_pattern)
      type: (type))
    parameter: (integer)
    parameter: (destructuring_pattern
      pattern: (struct_pattern
        member: (shorthand_member_pattern
          name: (identifier_pattern)
          type: (type)
          default: (integer))))
    body: (identifier))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern))
      body: (integer)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern))
      body: (integer)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (static_function
      parameter: (binding_pattern
        name: (type_pattern))
      value: (function
        parameter: (binding_pattern
          name: (identifier_pattern)
          type: (type)
          default: (integer))
        body: (infix_application
          left: (application
            name: (identifier)
            argument: (argument
              value: (infix_application
                left: (identifier)
                name: (identifier)
                right: (integer))))
          name: (identifier)
          right: (application
            name: (identifier)
            argument: (argument
              value: (infix_application
                left: (identifier)
                name: (identifier)
                right: (integer))))))))
  term: (static_function
    parameter: (binding_pattern
      name: (type_pattern)
      type: (type))
    value: (function
      rest: (binding_pattern
        name: (identifier_pattern)
        type: (type))
      body: (block
        term: (assignment
          pattern: (binding_pattern
            name: (identifier_pattern))
          value: (function
            parameter: (binding_pattern
              name: (identifier_pattern)
              type: (type))
            body: (identifier)))
        term: (application
          name: (identifier)
          argument: (argument
            value: (integer))))))
  term: (function
    body: (integer))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern))
      parameter: (binding_pattern
        name: (identifier_pattern))
      body: (identifier)))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (function_type
          from: (optional_type
            type: (type))
          to: (type))))
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern))
      parameter: (binding_pattern
        name: (identifier_pattern)
        default: (integer))
      body: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier)))))

==================
application
==================

a(1)(1, 2)
+(1)
a<Type<Type, Type>, Type>(?, 1)
+ 1
1 `a` -b
1 `a` -(b())
a(...(a, b))

f('String')
f(1)
f(())

---

(program
  term: (application
    name: (application
      name: (identifier)
      argument: (argument
        value: (integer)))
    argument: (argument
      value: (integer))
    argument: (argument
      value: (integer)))
  term: (application
    name: (identifier)
    argument: (argument
      value: (integer)))
  term: (application
    name: (parametric_type_instance
      name: (identifier)
      typeArgument: (parametric_type
        name: (type)
        argument: (parametric_type
          name: (type))
        argument: (parametric_type
          name: (type)))
      typeArgument: (parametric_type
        name: (type)))
    argument: (argument)
    argument: (argument
      value: (integer)))
  term: (application
    name: (identifier)
    argument: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (application
      name: (identifier)
      argument: (identifier)))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (application
      name: (identifier)
      argument: (argument
        value: (application
          name: (identifier)))))
  term: (application
    name: (identifier)
    argument: (argument
      value: (spread
        value: (tuple
          element: (identifier)
          element: (identifier)))))
  term: (application
    name: (identifier)
    argument: (argument
      value: (string)))
  term: (application
    name: (identifier)
    argument: (argument
      value: (integer)))
  term: (application
    name: (identifier)
    argument: (argument
      value: (tuple))))

==================
prefix application
==================

!false
+1
-1
~1

---

(program
  term: (application
    name: (identifier)
    argument: (boolean))
  term: (application
    name: (identifier)
    argument: (integer))
  term: (application
    name: (identifier)
    argument: (integer))
  term: (application
    name: (identifier)
    argument: (integer)))

==================
infix application
==================

1 .. 1
1 ^ 1
1 * 1
1 / 1
1 + 1
1 - 1
1 % 1
1 < 1
1 <= 1
1 > 1
1 >= 1
1 == 1
1 != 1
Type | Type
Type & Type
false && false
false || false
false ==> true <=> true
false && false || false
false || false && false
1 + 1 % 1
1 - 1 + 1
1 - -1
1 * 1 / 1 - 1
false || !false
(a.b) . c ^ 1 . (d.e)
a.b.c(1)
a&.b&.c(1)

---

(program
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (type)
    name: (identifier)
    right: (type))
  term: (infix_application
    left: (type)
    name: (identifier)
    right: (type))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean))
    name: (identifier)
    right: (boolean))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (infix_application
      left: (boolean)
      name: (identifier)
      right: (boolean)))
  term: (infix_application
    left: (infix_application
      left: (integer)
      name: (identifier)
      right: (integer))
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (infix_application
      left: (integer)
      name: (identifier)
      right: (integer))
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (integer)
    name: (identifier)
    right: (application
      name: (identifier)
      argument: (integer)))
  term: (infix_application
    left: (infix_application
      left: (infix_application
        left: (integer)
        name: (identifier)
        right: (integer))
      name: (identifier)
      right: (integer))
    name: (identifier)
    right: (integer))
  term: (infix_application
    left: (boolean)
    name: (identifier)
    right: (application
      name: (identifier)
      argument: (boolean)))
  term: (infix_application
    left: (infix_application
      left: (group
        term: (infix_application
          left: (identifier)
          name: (identifier)
          right: (identifier)))
      name: (identifier)
      right: (identifier))
    name: (identifier)
    right: (infix_application
      left: (integer)
      name: (identifier)
      right: (group
        term: (infix_application
          left: (identifier)
          name: (identifier)
          right: (identifier)))))
  term: (application
    name: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))
      name: (identifier)
      right: (identifier))
    argument: (argument
      value: (integer)))
  term: (application
    name: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))
      name: (identifier)
      right: (identifier))
    argument: (argument
      value: (integer))))

==================
sections
==================

((+) 1)
(1 (+))
(`mod` 1)
(1 `mod`)

---

(program
  term: (right_section
    name: (identifier)
    value: (integer))
  term: (left_section
    value: (integer)
    name: (identifier))
  term: (right_section
    name: (identifier)
    value: (integer))
  term: (left_section
    value: (integer)
    name: (identifier)))

==================
access
==================

a[0]
a->b(1)
a.b[c]

---

(program
  term: (access
      left: (identifier)
      right: (integer))
  term: (application
    name: (access
      left: (identifier)
      right: (shorthand_access_identifier))
    argument: (argument
      value: (integer)))
  term: (access
    left: (infix_application
      left: (identifier)
      name: (identifier)
      right: (identifier))
    right: (identifier)))

==================
assignment
==================

a: Type = 1
a = (a: Type) =>
  1

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern)
      type: (type))
    value: (integer))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern)
        type: (type))
      body: (integer))))

==================
export
==================

export a = 1
export a = (x: T) =>
  1

---

(program
  term: (export
    declaration: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (integer)))
  term: (export
    declaration: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (function
        parameter: (binding_pattern
          name: (identifier_pattern)
          type: (type))
        body: (integer)))))

==================
return
==================

return 1
return (a: Type) =>
  1

---

(program
  term: (return
    value: (integer))
  term: (return
    value: (function
      parameter: (binding_pattern
        name: (identifier_pattern)
        type: (type))
      body: (integer))))

==================
conditional
==================

false ?
  1
true ? {
  1
  1
} : 1

a =
  true ? {
    1
  } : false ? 1 : true ? {
    1
  }

fn(false ? 1)
true ? 1 : 1

---

(program
  term: (conditional
    condition: (boolean)
    body: (integer))
  term: (conditional
    condition: (boolean)
    body: (block
      term: (integer)
      term: (integer))
    else: (integer))
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (conditional
      condition: (boolean)
      body: (block
        term: (integer))
      else: (conditional
        condition: (boolean)
        body: (integer)
        else: (conditional
          condition: (boolean)
          body: (block
            term: (integer))))))
  term: (application
    name: (identifier)
    argument: (argument
      value: (conditional
        condition: (boolean)
        body: (integer))))
  term: (conditional
    condition: (boolean)
    body: (integer)
    else: (integer)))

==================
case
==================

a =
  case a
  when 1 then {
    1
  }
  else 1

case a
when [1, a: Type] {
  a
}
when 1, 1 then 1
else {
  1
  1
}

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (identifier_pattern))
    value: (case
      value: (identifier)
      when: (when
        pattern: (integer)
        body: (block
          term: (integer)))
      else: (integer)))
  term: (case
    value: (identifier)
    when: (when
      pattern: (destructuring_pattern
        pattern: (list_pattern
          element: (integer)
          element: (binding_pattern
            name: (identifier_pattern)
            type: (type))))
      body: (block
        term: (identifier)))
    when: (when
      pattern: (integer)
      pattern: (integer)
      body: (integer))
    else: (block
      term: (integer)
      term: (integer))))

==================
class
==================

class Type {
  a: Type -> Number
  b: Type -> Number
}
class Ord: Num & Eq {
  compare: Ord -> Ord -> Number
}

---

(program
  term: (class
    name: (type)
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (type)))
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (type))))
  term: (class
    name: (type)
    constraint: (infix_application
      left: (type)
      name: (identifier)
      right: (type))
    member: (class_member
      name: (identifier_pattern)
      type: (function_type
        from: (type)
        to: (function_type
          from: (type)
          to: (type))))))

==================
instance
==================

instance Number of Ord {
  compare = 1
}
instance (T: Type, U: Type) => Type(T, U) of Type {
  f = 1
}

---

(program
  term: (instance
    type: (type)
    class: (type)
    assignment: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (integer)))
  term: (instance
    type: (function
      parameter: (binding_pattern
        name: (type_pattern)
        type: (type))
      parameter: (binding_pattern
        name: (type_pattern)
        type: (type))
      body: (application
        name: (type)
        argument: (argument
          value: (type))
        argument: (argument
          value: (type))))
    class: (type)
    assignment: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (integer))))

==================
struct
==================

{}
{ a, b }
{ ['a']: 1, ...b, c: 'str', d, e }

---

(program
  term: (struct)
  term: (struct
    member: (shorthand_member)
    member: (shorthand_member))
  term: (struct
    member: (member
      key: (string)
      value: (integer))
    member: (spread
      value: (identifier))
    member: (member
      key: (shorthand_member_identifier)
      value: (string))
    member: (shorthand_member)
    member: (shorthand_member)))

==================
tuple
==================

()
(a, 1, 'str', ...x)
(1,1)

---

(program
  term: (tuple)
  term: (tuple
    element: (identifier)
    element: (integer)
    element: (string)
    element: (spread
      value: (identifier)))
  term: (tuple
    element: (integer)
    element: (integer)))

==================
list
==================

[]
[a, 1, ...b, 'str']
[1,1..1,1]

---

(program
  term: (list)
  term: (list
    element: (identifier)
    element: (integer)
    element: (spread
      value: (identifier))
    element: (string))
  term: (list
    element: (integer)
    element: (infix_application
      left: (integer)
      name: (identifier)
      right: (integer))
    element: (integer)))

==================
list comprehension
==================

[i * 2 | i in 1..10]
[i / 2 | i in 1..10, i % 2 == 0]
[[x, y] | x in 1..10, x % 2 == 0, y in 1..10, i % 2 == 0]

---

(program
  term: (list_comprehension
    body: (infix_application
      left: (identifier)
      name: (identifier)
      right: (integer))
    generator: (generator
      name: (identifier_pattern)
      value: (infix_application
        left: (integer)
        name: (identifier)
        right: (integer))))
  term: (list_comprehension
    body: (infix_application
      left: (identifier)
      name: (identifier)
      right: (integer))
    generator: (generator
      name: (identifier_pattern)
      value: (infix_application
        left: (integer)
        name: (identifier)
        right: (integer)))
    condition: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (integer))
      name: (identifier)
      right: (integer)))
  term: (list_comprehension
    body: (list
      element: (identifier)
      element: (identifier))
    generator: (generator
      name: (identifier_pattern)
      value: (infix_application
        left: (integer)
        name: (identifier)
        right: (integer)))
    condition: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (integer))
      name: (identifier)
      right: (integer))
    generator: (generator
      name: (identifier_pattern)
      value: (infix_application
        left: (integer)
        name: (identifier)
        right: (integer)))
    condition: (infix_application
      left: (infix_application
        left: (identifier)
        name: (identifier)
        right: (integer))
      name: (identifier)
      right: (integer))))

==================
static function / application
==================

value<Type>;
(<T>(a: T) => a)<Type>

---

(program
  term: (static_application
    value: (identifier)
    argument: (type))
  term: (static_application
    value: (group
      term: (static_function
        parameter: (binding_pattern
          name: (type_pattern))
        value: (function
          parameter: (binding_pattern
            name: (identifier_pattern)
            type: (type))
          body: (identifier))))
    argument: (type)))

==================
block
==================

{
  y = 1
  z = pure x
  return y + z
}
10.times (i) => {
  io->print '{i}-th line'
}

---

(program
  term: (block
    term: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (integer))
    term: (assignment
      pattern: (binding_pattern
        name: (identifier_pattern))
      value: (pure
        value: (identifier)))
    term: (return
      value: (infix_application
        left: (identifier)
        name: (identifier)
        right: (identifier))))
  term: (application
    name: (infix_application
      left: (integer)
      name: (identifier)
      right: (identifier))
    argument: (function
      parameter: (binding_pattern
        name: (identifier_pattern))
      body: (block
        term: (application
          name: (access
            left: (identifier)
            right: (shorthand_access_identifier))
          argument: (string
            interpolation: (interpolation
              term: (identifier))))))))

==================
type alias
==================

Type = Type
Type = (T, U: Num) => T -> U
GreaterThan = (T, x: T) => T

---

(program
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
    value: (type))
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
      value: (function
        parameter: (binding_pattern
          name: (type_pattern))
        parameter: (binding_pattern
          name: (type_pattern)
          type: (type))
        body: (function_type
          from: (type)
          to: (type))))
  term: (assignment
    pattern: (binding_pattern
      name: (type_pattern))
      value: (function
        parameter: (binding_pattern
          name: (type_pattern))
        parameter: (binding_pattern
          name: (identifier_pattern)
          type: (type))
        body: (type))))

==================
data
==================

data Type = tag Type
data Type = tag Type | tag

---

(program
  term: (data
    name: (type)
    constructor: (tag
      name: (identifier_pattern)
      type: (type)))
  term: (data
    name: (type)
    constructor: (tag
      name: (identifier_pattern)
      type: (type))
    constructor: (tag
      name: (identifier_pattern))))

==================
type hint
==================

'string' as String

---

(program
  term: (type_hint
    value: (string)
    type: (type)))

==================
hole
==================

?hole

---

(program
  term: (hole
    name: (identifier_pattern)))

==================
group
==================

(1)
(n)
(-1)
(-n)
n / ((n + 1) * (-2))

---

(program
  term: (group
    term: (integer))
  term: (group
    term: (identifier))
  term: (group
    term: (application
      name: (identifier)
      argument: (integer)))
  term: (group
    term: (application
      name: (identifier)
      argument: (identifier)))
  term: (infix_application
    left: (identifier)
    name: (identifier)
    right: (group
      term: (infix_application
        left: (group
          term: (infix_application
            left: (identifier)
            name: (identifier)
            right: (integer)))
        name: (identifier)
        right: (group
          term: (application
            name: (identifier)
            argument: (integer)))))))
